sakshamg96/Nucleo-MCU1/MCU1/stm32f4xx_drivers/drivers/Inc/stm32f46xx_usart_driver.h
/*
 * stm32f46xx_usart_driver.h
 *
 *  Created on: 02-Jan-2021
 *      Author: saksh
 */

#ifndef INC_STM32F46XX_USART_DRIVER_H_
#define INC_STM32F46XX_USART_DRIVER_H_

#include "stm32f46xx.h"

typedef struct
{
	uint8_t USART_Mode;				/*|< Asynchronous or synchronous mode >|*/
	uint32_t USART_Baud;				/*|< Baud rate >|*/
	uint8_t USART_NoOfStopBits;		/*|< Number of stop bits >|*/
	uint8_t USART_WordLength;		/*|< Number of data bits >|*/
	uint8_t USART_ParityControl;	/*|< Even/Odd/no parity >|*/
	uint8_t USART_HWFlowControl;	/*|< Number of stop bits >|*/

}USART_config_t;

typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_config_t USART_Config;
	uint8_t				*pTxBuffer;		/* |< Hold the buffer address while sending data >| */
	uint8_t				*pRxBuffer;		/* |< Hold the buffer address while receiving data >| */
	uint32_t			TxLen;			/* |< Hold the remaining length of data during send >| */
	uint32_t			RxLen;			/* |< Hold the remaining length of data during receive >| */
	uint8_t				TxState;		/* |< Hold the USART send status >| */
	uint8_t				RxState;		/* |< Hold the USART receive status >| */
}USART_Handle_t;

/*
 *@USART_Mode
 *Possible options for USART_Mode
 */
#define USART_MODE_ONLY_TX 0
#define USART_MODE_ONLY_RX 1
#define USART_MODE_TXRX  2

/*
 *@USART_Baud
 *Possible options for USART_Baud
 */
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					2400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define SUART_STD_BAUD_3M 					3000000


/*
 *@USART_ParityControl
 *Possible options for USART_ParityControl
 */
#define USART_PARITY_EN_ODD   2
#define USART_PARITY_EN_EVEN  1
#define USART_PARITY_DISABLE   0

/*
 *@USART_WordLength
 *Possible options for USART_WordLength
 */
#define USART_WORDLEN_8BITS  0
#define USART_WORDLEN_9BITS  1

/*
 *@USART_NoOfStopBits
 *Possible options for USART_NoOfStopBits
 */
#define USART_STOPBITS_1     0
#define USART_STOPBITS_0_5   1
#define USART_STOPBITS_2     2
#define USART_STOPBITS_1_5   3

/*
 *@USART_HWFlowControl
 *Possible options for USART_HWFlowControl
 */
#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS    	1
#define USART_HW_FLOW_CTRL_RTS    	2
#define USART_HW_FLOW_CTRL_CTS_RTS	3

/*
 * @TxRxState
 */
#define USART_READY			0
#define USART_BUSY_IN_TX	1
#define USART_BUSY_IN_RX	2

/*
 * @USART application callback event state
 */
#define USART_EV_TX_DONE	0
#define USART_EV_RX_DONE	1
#define USART_EV_CTS		2
#define USART_EV_IDLE		3
#define USART_EV_ORE		4
#define USART_ERR_FE		5
#define USART_ERR_NE		6
#define USART_ERR_ORE		7

/************************************************************************************
 * 						APIs supported by this driver
 * 			For more information about the APIs check the function definitions
 ************************************************************************************/

/*
 * Peripheral clock setup
 */
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi);

/*
 * Init and De-init
 */
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_DeInit(USART_RegDef_t *pUSARTx);

/*
 * Data Send and Receive
 */
void USART_SendData(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);


/*
 * IRQ configuration and ISR handling
 */
void USART_IRQConfig(uint8_t IRQNumber, uint8_t IRQPriority, uint8_t EnorDi);
void USART_IRQHandling(USART_Handle_t *pHandle);

/*
 * Other configuration APIs
 */
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);
uint8_t USART_GetFlagStatus(uint32_t reg, uint32_t bit);
void USART_ClearFlag(uint32_t reg, uint32_t bit);
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);

/*
 * Application callback
 */
void USART_ApplicationEventCallback(USART_Handle_t* pUSARTHandle, uint8_t AppEvent);

#endif /* INC_STM32F46XX_USART_DRIVER_H_ */
